In [2]:
import numpy as np
import pandas as pd

# Filter outliers practice:

data = pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005068     0.005987    -0.018362    -0.005166
std       1.003241     1.036120     0.972067     1.006404
min      -2.695075    -2.992575    -3.203335    -3.388106
25%      -0.710823    -0.669401    -0.671561    -0.675996
50%      -0.007274    -0.012792    -0.061003     0.028531
75%       0.665455     0.678565     0.636030     0.682643
max       3.296015     3.379078     3.707295     3.031620

In [3]:
col = data[2] # extract third column
col[col.abs() > 3]

121    3.707295
629   -3.056464
773   -3.203335
Name: 2, dtype: float64

In [4]:
data[(data.abs() > 3).any(axis="columns")] # extract row with any column value with abs > 3

            0         1         2         3
121 -1.695466  0.001337  3.707295  1.192678
279  0.947773  3.181280 -0.602879  0.202868
305 -0.821771 -0.123556 -0.333331 -3.388106
491  0.426673 -0.135977  1.347204  3.031620
629  0.092030  2.429081 -3.056464  0.600161
731 -0.333331  3.379078  0.271571 -0.177051
773 -0.593144  1.331136 -3.203335 -0.088543
800  3.296015 -1.423611  0.481656 -0.220178

In [5]:
# Cap values outside -2 to 2
data[data.abs() > 2] = np.sign(data)*2
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.009948     0.009112    -0.016305    -0.002584
std       0.967015     0.986088     0.935970     0.971914
min      -2.000000    -2.000000    -2.000000    -2.000000
25%      -0.710823    -0.669401    -0.671561    -0.675996
50%      -0.007274    -0.012792    -0.061003     0.028531
75%       0.665455     0.678565     0.636030     0.682643
max       2.000000     2.000000     2.000000     2.000000

In [6]:
# Permutation and Random Sampling
df = pd.DataFrame(np.arange(3*4).reshape((3,4)))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [7]:
sampler = np.random.permutation(3)
sampler

array([1, 2, 0])

In [8]:
df.take(sampler)

   0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3

In [9]:
# Alternative way to code df.take(sampler)
df.iloc[sampler]

   0  1   2   3
1  4  5   6   7
2  8  9  10  11
0  0  1   2   3

In [10]:
# Shuffle columns instead
column_sampler = np.random.permutation(4)
df.take(column_sampler, axis="columns")

   0   2   3  1
0  0   2   3  1
1  4   6   7  5
2  8  10  11  9

In [11]:
# The sample method selects random rows without replacement
df.sample(n=2)

   0  1   2   3
2  8  9  10  11
0  0  1   2   3

In [12]:
# Indicator/dummy variables
df = pd.DataFrame({"key":["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [13]:
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [14]:
movie_cols = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::", header=None, names=movie_cols, engine="python")
movies[:20]

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children's
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
10,11,"American President, The (1995)",Comedy|Drama|Romance
11,12,Dracula: Dead and Loving It (1995),Comedy|Horror
12,13,Balto (1995),Animation|Children's
13,14,Nixon (1995),Drama
14,15,Cutthroat Island (1995),Action|Adventure|Romance
15,16,Casino (1995),Drama|Thriller
16,17,Sense and Sensibility (1995),Drama|Romance
17,18,Four Rooms (1995),Thriller
18,19,Ace Ventura: When Nature Calls (1995),Comedy
19,20,Money Train (1995),Action

In [15]:
# Use str.get_dummies to pull the different genre types
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6] # extract first 10 rows and first 6 columns

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [16]:
movies_w_indices = movies.join(dummies.add_prefix("Genre: "))
movies_w_indices.iloc[0]

movie_id                                        1
title                            Toy Story (1995)
genres                Animation|Children's|Comedy
Genre: Action                                   0
Genre: Adventure                                0
Genre: Animation                                1
Genre: Children's                               1
Genre: Comedy                                   1
Genre: Crime                                    0
Genre: Documentary                              0
Genre: Drama                                    0
Genre: Fantasy                                  0
Genre: Film-Noir                                0
Genre: Horror                                   0
Genre: Musical                                  0
Genre: Mystery                                  0
Genre: Romance                                  0
Genre: Sci-Fi                                   0
Genre: Thriller                                 0
Genre: War                                      0
Genre: Western                                  0
Name: 0, dtype: object

7.3 extension data types discusses new support in pandas for data types that numpy doesn't support. Interesting but sort of niche, I won't practice it here.

7.4 String Manipulation

In [17]:
# String munging example: strip extra white space
val = "a,b,    scottarooni"

val.split(",")

['a', 'b', '    scottarooni']

In [18]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'scottarooni']

In [19]:
# Join pieces together with :: between
"::".join(pieces)

'a::b::scottarooni'

In [20]:
# Practice with regular expressions (regex)

import re

text = "papa      johns\t  kinda sucks    \t."
re.split(r"\s+", text)

# Alternative:
regex = re.compile(r"\s+")
regex.split(text)

['papa', 'johns', 'kinda', 'sucks', '.']

In [21]:
# Example identifying email addresses:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

regex = re.compile(pattern, flags=re.IGNORECASE)

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [22]:
# String Functions in pandas

In [23]:
# dict with missing data:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com", "Rob": "rob@gmail.com", "Wes": np.nan}

data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [24]:
# Series has a contains method which skips over NA values
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [25]:
# Change to string type
data_as_string = data.astype('string')
data_as_string

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [26]:
# Extract unique values from a series, count instances of values:
values = pd.Series(['apple','orange','apple','apple']*2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [28]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [29]:
pd.value_counts(values)

apple     6
orange    2
dtype: int64

In [31]:
# Set up dimension table:
values = pd.Series([0,1,0,0]*2)
dim = pd.Series(['apple','orange'])

values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [32]:
dim

0     apple
1    orange
dtype: object

In [33]:
# take will return the Series of apples and oranges
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [34]:
# Using categorical extension type for encoding:
fruits = ['apple','orange','apple','apple','kiwi']*2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                   columns=['basket_id','fruit','count','weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.331256
1          1  orange      5  2.393235
2          2   apple     12  0.746937
3          3   apple      6  2.691024
4          4    kiwi      5  3.767211
5          5   apple     12  0.992983
6          6  orange     10  3.795525
7          7   apple     11  2.668950
8          8   apple     14  0.383592
9          9    kiwi      7  1.767359

In [35]:
# df['fruit'] is an array of strings, but we can convert it to categorical type
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4      kiwi
5     apple
6    orange
7     apple
8     apple
9      kiwi
Name: fruit, dtype: category
Categories (3, object): ['apple', 'kiwi', 'orange']

In [36]:
# Find mapping between codes and categories:
c = fruit_cat.array
dict(enumerate(c.categories))

{0: 'apple', 1: 'kiwi', 2: 'orange'}

In [39]:
# Create a categorical object from a list:
list = ['foo','bar', 'baz', 'foo', 'bar']
my_categories = pd.Categorical(list)
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [41]:
# Bin data using qcut to return a categorical datatype
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:10]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331,
       -0.74088465, -1.3677927 ,  0.6488928 ,  0.36105811, -1.95286306])

In [42]:
# Quartile binning
bins = pd.qcut(draws,4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [43]:
# Label the quartiles
bins = pd.qcut(draws, 4, labels=['Q1','Q2','Q3','Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [44]:
# Extract summary statistics from the quartiles:
bins = pd.Series(bins, name='quartile')
bins

0      Q1
1      Q4
2      Q1
3      Q2
4      Q2
       ..
995    Q3
996    Q3
997    Q2
998    Q3
999    Q2
Name: quartile, Length: 1000, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [45]:
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count','min','max'])
           .reset_index())
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [47]:
# Using categoricals to improve performance:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux']*(N//4))
# Convert labels to categorical:
categories = labels.astype('category')

In [48]:
# Check memory usage on labels vs categories
labels.memory_usage(deep=True)

600000128

In [49]:
categories.memory_usage(deep=True)

10000528

In [50]:
# Check time to convert
%time _ = labels.astype('category')

CPU times: user 278 ms, sys: 35.8 ms, total: 314 ms
Wall time: 316 ms

In [51]:
# Check performance of value_counts() on labels vs categories
%timeit labels.value_counts()

465 ms  17.7 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [52]:
%timeit categories.value_counts()

27.4 ms  2.33 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

In [53]:
# Test out some methods on the categorical data type:
s = pd.Series(['a','b','c','d']*2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [54]:
# Access the codes and/or and categories:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [55]:
# Change the categories:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [56]:
# Remove unused categories:
cat_s2.cat.remove_unused_categories()

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']